Repository: AtelierMizumi/FFmpeg-Converter-App
Catalog: lib/l10n/app_*.arb
Languages: de, ja, vi

# appTitle
source: FFmpeg Converter Pro
de: FFmpeg Konverter Pro
ja: FFmpeg コンバーター Pro

# tabConverter
source: Converter
de: Konverter
ja: 変換
vi: Chuyển đổi

# tabGuide
source: Guide
de: Anleitung
ja: ガイド
vi: Hướng dẫn

# tabAbout
source: About
de: Über
ja: 情報
vi: Thông tin

# dragDropText
source: Drag & drop video here or click to pick file
de: Video hierher ziehen oder klicken zum Auswählen
ja: ここに動画をドラッグ＆ドロップ またはクリックしてファイルを選択
vi: Kéo thả video vào đây hoặc click để chọn file

# fileSelected
source: Selected: {filename}
de: Ausgewählt: {filename}
ja: 選択中: {filename}
vi: Đã chọn: {filename}

# pickOutputFolder
source: Export Folder
de: Exportordner
ja: 出力フォルダ (Export)
vi: Thư mục xuất file (Export)

source: Not selected...
de: Nicht ausgewählt...
ja: 未選択...
vi: Chưa chọn thư mục...

source: Start Conversion
de: Konvertierung starten
ja: 変換開始
vi: Bắt đầu chuyển đổi

source: Processing...
de: Verarbeite...
ja: 処理中...
vi: Đang xử lý...

# statusReady
source: Ready
de: Bereit
ja: 準備完了
vi: Sẵn sàng

# statusSuccess
source: Success! Output ready.
de: Erfolg! Ausgabe bereit.
ja: 成功！ 出力準備完了。
vi: Thành công! File đã sẵn sàng.

# statusError
source: Error: {error}
de: Fehler: {error}
ja: エラー: {error}
vi: Lỗi: {error}

source: Save Output
de: Ausgabe speichern
ja: 結果を保存
vi: Lưu file kết quả

# compareVideo
source: Visual Comparison
de: Visueller Vergleich
ja: 比較 (Visual Comparison)
vi: So sánh (Visual Comparison)

# settingsTitle
source: Encode Settings
de: Kodierungseinstellungen
ja: エンコード設定
vi: Cấu hình Encode

source: Container Format
ja: コンテナ形式
vi: Đuôi file (Container)

source: Video Codec
ja: ビデオコーデック

source: Resolution
de: Auflösung
ja: 解像度
vi: Độ phân giải

source: Audio Settings
de: Audio-Einstellungen
ja: 音声設定
vi: Thiết lập âm thanh

source: Preset (Speed)
de: Voreinstellung (Geschwindigkeit)
ja: プリセット (速度)
vi: Tốc độ (Preset)

# qualityCrf
source: Video Quality (CRF): {crf}
de: Videoqualität (CRF): {crf}
ja: ビデオ品質 (CRF): {crf}
vi: Chất lượng Video (CRF): {crf}

# lowerBetter
source: Lower = Better Quality (Larger Size)
de: Niedriger = Bessere Qualität (Größere Datei)
ja: 低いほど高品質 (ファイルサイズ大)
vi: Thấp hơn = Chất lượng tốt hơn (Dung lượng lớn)

source: Original
ja: オリジナル
vi: Gốc

# newFile
source: New
de: Neu
ja: 新規
vi: Mới

# folderExportRequired
source: Please select Export Folder before processing!
de: Bitte wählen Sie vor der Verarbeitung den Exportordner aus!
ja: 処理の前にエクスポートフォルダを選択してください！
vi: Vui lòng chọn thư mục lưu (Export Folder) trước khi xử lý!

# guideTitle
source: User Guide & Documentation
de: Benutzerhandbuch & Dokumentation
ja: ユーザーガイドとドキュメント
vi: Hướng dẫn sử dụng & Tài liệu

# guideIntro
source: This application leverages FFmpeg to convert videos directly on your device (Web or Desktop) without processing data on a server.
de: Diese Anwendung nutzt FFmpeg, um Videos direkt auf Ihrem Gerät (Web oder Desktop) zu konvertieren, ohne Daten an einen Server zu senden.
ja: このアプリケーションはFFmpegを活用して、データをサーバーに送信することなく、デバイス上（Webまたはデスクトップ）で直接ビデオを変換します。
vi: Ứng dụng này sử dụng sức mạnh của FFmpeg để chuyển đổi video trực tiếp trên thiết bị của bạn (Web hoặc Desktop) mà không cần gửi dữ liệu lên máy chủ.

# sectionSettings
source: Technical Settings
de: Technische Einstellungen
ja: 技術設定
vi: Các thông số kỹ thuật (Settings)

# paramVideoCodec
source: 1. Video Codec
ja: 1. ビデオコーデック

# paramVideoCodecDesc
source: The video encoder. Determines how image data is compressed.
de: Der Video-Encoder. Bestimmt, wie Bilddaten komprimiert werden.
ja: ビデオエンコーダー。画像データの圧縮方法を決定します。
vi: Bộ mã hóa video. Quyết định cách thức nén dữ liệu hình ảnh.

# paramVideoCodecDetails
source: - **H.264 (libx264):** Most popular, compatible with almost all devices. Good balance of speed and quality. - **VP9 (libvpx-vp9):** Google's open source codec, often used for Web/YouTube. Better compression than H.264 but slower encoding.
de: - **H.264 (libx264):** Am beliebtesten, kompatibel mit fast allen Geräten. Gute Balance zwischen Geschwindigkeit und Qualität. - **H.265 (libx265):** Höhere Komprimierungseffizienz als H.264 (ca. 50% kleinere Dateien). Erfordert mehr Rechenleistung zum Enkodieren/Dekodieren. - **VP9 (libvpx-vp9):** Googles Open-Source-Codec, oft verwendet für Web/YouTube. Bessere Komprimierung als H.264, aber langsamere Codierung. - **AV1 (libaom-av1):** Codec der nächsten Generation. Beste Komprimierung, lizenzfrei, aber sehr langsame Kodierung ohne Hardwarebeschleunigung. - **MPEG-4 (libxvid):** Älterer Standard. Sehr hohe Kompatibilität mit älteren Geräten, aber weniger effiziente Komprimierung.
ja: - **H.264 (libx264):** 最も一般的で、ほぼすべてのデバイスと互換性があります。速度と品質のバランスが良いです。 - **VP9 (libvpx-vp9):** Googleのオープンソースコーデックで、Web/YouTubeでよく使用されます。H.264よりも圧縮率は高いですが、エンコードは遅いです。
vi: - **H.264 (libx264):** Phổ biến nhất, tương thích mọi thiết bị. Cân bằng tốt giữa tốc độ và chất lượng. - **H.265 (libx265):** Hiệu suất nén cao hơn H.264 (file nhỏ hơn khoảng 50%). Yêu cầu cấu hình mạnh hơn để encode/decode. - **VP9 (libvpx-vp9):** Codec mã nguồn mở của Google, thường dùng cho Web/YouTube. Nén tốt hơn H.264 nhưng encode chậm hơn. - **AV1 (libaom-av1):** Codec thế hệ mới. Nén tốt nhất, miễn phí bản quyền, nhưng encode rất chậm nếu không có phần cứng hỗ trợ. - **MPEG-4 (libxvid):** Chuẩn cũ. Tương thích rất cao với thiết bị đời cũ, nhưng nén kém hiệu quả hơn.

# paramCrfDesc
source: The metric determining output video quality.
de: Die Kennzahl, die die Ausgabequalität des Videos bestimmt.
ja: 出力ビデオの品質を決定する指標。
vi: Chỉ số quyết định chất lượng video đầu ra.

# paramCrfDetails
source: - Range: 0-51. - **0:** Lossless (No compression, huge file size). - **23:** Default (Balanced). - **18:** High Quality (Visually lossless). - **28:** Lower Quality (Smaller file size). *Rule: LOWER value = HIGHER quality = LARGER size.*
de: - Bereich: 0-51. - **0:** Verlustfrei (Keine Komprimierung, riesige Dateigröße). - **23:** Standard (Ausgewogen). - **18:** Hohe Qualität (Visuell verlustfrei). - **28:** Geringere Qualität (Kleinere Dateigröße). *Regel: NIEDRIGERER Wert = HÖHERE Qualität = GRÖSSERE Größe.*
ja: - 範囲: 0-51。 - **0:** ロスレス (圧縮なし、ファイルサイズ大)。 - **23:** デフォルト (バランス)。 - **18:** 高品質 (視覚的にロスレス)。 - **28:** 低品質 (ファイルサイズ小)。 *ルール: 値が低いほど = 品質が高い = サイズが大きい。*
vi: - Dải giá trị: 0-51. - **0:** Lossless (Không nén, dung lượng cực lớn). - **23:** Mặc định (Cân bằng). - **18:** Chất lượng cao (Gần như gốc). - **28:** Chất lượng thấp hơn (Dung lượng nhỏ). *Nguyên tắc: Giá trị càng NHỎ, chất lượng càng CAO, dung lượng càng LỚN.*

# paramPreset
source: 3. Preset
ja: 3. プリセット

# paramPresetDesc
source: Compression Speed.
de: Komprimierungsgeschwindigkeit.
ja: 圧縮速度。
vi: Tốc độ nén (Encoding Speed).

# paramPresetDetails
source: - **ultrafast/superfast:** Very fast, but larger output file for the same quality. - **medium:** Default. Balanced. - **slow/veryslow:** Very slow, but most efficient compression (smallest file for same quality). *Recommendation: "medium" or "fast" for general use.*
de: - **ultrafast/superfast:** Sehr schnell, aber größere Ausgabedatei bei gleicher Qualität. - **medium:** Standard. Ausgewogen. - **slow/veryslow:** Sehr langsam, aber effizienteste Komprimierung (kleinste Datei bei gleicher Qualität). *Empfehlung: "medium" oder "fast" für den allgemeinen Gebrauch.*
ja: - **ultrafast/superfast:** 非常に高速ですが、同じ品質でも出力ファイルが大きくなります。 - **medium:** デフォルト。バランス。 - **slow/veryslow:** 非常に遅いですが、最も効率的な圧縮（同じ品質で最小のファイル）。 *推奨: 一般的な使用には "medium" または "fast"。*
vi: - **ultrafast/superfast:** Rất nhanh, nhưng file output sẽ lớn hơn với cùng một chất lượng. - **medium:** Mặc định. Cân bằng. - **slow/veryslow:** Rất chậm, nhưng nén file hiệu quả nhất (file nhỏ nhất với cùng chất lượng). *Khuyên dùng: "medium" hoặc "fast" cho nhu cầu thông thường.*

# paramResolution
source: 4. Resolution
de: 4. Auflösung
ja: 4. 解像度
vi: 4. Resolution (Độ phân giải)

# paramResolutionDesc
source: Resize video dimensions.
de: Videodimensionen ändern.
ja: ビデオの寸法を変更します。
vi: Thay đổi kích thước khung hình video.

# paramResolutionDetails
source: - **Original:** Keep original size. - **1080p/720p/480p:** Resize video height to specific value (width calculated automatically). Significantly reduces file size.
de: - **Original:** Originalgröße beibehalten. - **1080p/720p/480p:** Videohöhe auf bestimmten Wert ändern (Breite automatisch berechnet). Reduziert die Dateigröße erheblich.
ja: - **Original:** 元のサイズを維持。 - **1080p/720p/480p:** ビデオの高さを指定した値に変更します（幅は自動計算）。ファイルサイズを大幅に削減します。
vi: - **Original:** Giữ nguyên gốc. - **1080p/720p/480p:** Resize video về chiều cao tương ứng (chiều rộng tự động tính theo tỉ lệ). Giúp giảm dung lượng đáng kể.

# sectionReferences
source: References
de: Referenzen
ja: 参考文献
vi: Tài liệu tham khảo

source: Developed by
de: Entwickelt von
ja: 開発者
vi: Phát triển bởi

# technologies
source: Technologies Used
de: Verwendete Technologien
ja: 使用技術
vi: Công nghệ sử dụng

# librariesLicenses
source: Third Party Libraries & Licenses
de: Drittanbieter-Bibliotheken & Lizenzen
ja: サードパーティライブラリとライセンス
vi: Thư viện bên thứ ba & Giấy phép
